## Introduction to social data science
#### Pandas
##### Series：
<center>A vector/list with labels for each entry.由data,index赋值<center>
<center>和dic的区别：series的indices可以相同,且有序<center>

In [74]:
import pandas as pd
import numpy as np

In [75]:
#设置一个series
L = [1, 1.2, 'abc', True]

my_series = pd.Series(L)
my_series

0       1
1     1.2
2     abc
3    True
dtype: object

In [76]:
#具有自定义索引的series
num_data = range(0,3) # Generate data
indices = ['B', 'C', 'A'] # Generate index names
my_series2 = pd.Series(data=num_data, index=indices) # Create a pandas series from the two
my_series2

B    0
C    1
A    2
dtype: int64

In [77]:
#series转dictionary
my_series.to_dict()

{0: 1, 1: 1.2, 2: 'abc', 3: True}

In [78]:
#dictionary转series
d = {'yesterday': 0, 'today': 1, 'tomorrow':3} # Create some dictionary
my_series3 = pd.Series(d) # Use the constructor
my_series3

yesterday    0
today        1
tomorrow     3
dtype: int64

In [79]:
s = pd.Series(range(3), index=['A','A', 'A']) # Create series with same indices
print(s) # Check duplicates

A    0
A    1
A    2
dtype: int64

##### Data Frame:
<center>A 2d-array (matrix) with labelled columns and rows (which are called indices). <center>

In [80]:
#创建2*2data frame
df = pd.DataFrame(data=[[1,2],[3,4]],
                  columns=['A', 'B'])
df

   A  B
0  1  2
1  3  4

In [81]:
#从dic创建data frame
djan = {'1st': 0, '2nd': 1, '3rd':3} # Create some dictionary for january
dfeb = {'1st': -3, '2nd': -1, '3rd':-2} # Create some dictionary for february
dmar = {'1st': 3, '2nd': 5, '3rd':4} # Create some dictionary for march

d = {'january': djan, 'february': dfeb, 'march': dmar} # Create dictionary of dictionaries
my_df1 = pd.DataFrame(d) # Use the constructor
my_df1

     january  february  march
1st        0        -3      3
2nd        1        -1      5
3rd        3        -2      4

In [82]:
#用astype转换数据格式
print(my_series3)
print()
print(my_series3.astype(float))
print()
print(my_series3.astype(str))

yesterday    0
today        1
tomorrow     3
dtype: int64

yesterday    0.0
today        1.0
tomorrow     3.0
dtype: float64

yesterday    0
today        1
tomorrow     3
dtype: object

In [83]:
#打印头3行，尾3行
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(3)
#titanic.tail(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [84]:
# use loc and .iloc to select
print(titanic.loc[range(3),['survived', 'age', 'sex']])
print(titanic.iloc[10:15,:5])
# use column to select
titanic[['survived']].head(3)

   survived   age     sex
0         0  22.0    male
1         1  38.0  female
2         1  26.0  female
    survived  pclass     sex   age  sibsp
10         1       3  female   4.0      1
11         1       1  female  58.0      0
12         0       3    male  20.0      0
13         0       3    male  39.0      1
14         0       3  female  14.0      0

   survived
0         0
1         1
2         1

In [85]:
# change the index of Data Frame
my_df = pd.DataFrame([[1,2], [3,4], [5,6]], columns = ['a', 'b'], index = ['i', 'ii', 'iii'])
print(my_df)
my_df_a = my_df.set_index('a')
print(my_df_a)
print(my_df_a.reset_index()) # drop=True
print()
print(my_df_a.reset_index(drop=True)) # drop=True

# change column names
my_df.columns = ['A', 'B']
print(my_df)
my_df.rename(columns={'A': 'Aa'}, inplace=True)
print(my_df)

#sort data
my_loc2 = ['i', 'iii']
my_df.loc[my_loc2, 'Aa'] = 10

print(my_df.sort_values(by='Aa', ascending=True))
print(my_df.sort_index())

     a  b
i    1  2
ii   3  4
iii  5  6
   b
a
1  2
3  4
5  6
   a  b
0  1  2
1  3  4
2  5  6

   b
0  2
1  4
2  6
     A  B
i    1  2
ii   3  4
iii  5  6
     Aa  B
i     1  2
ii    3  4
iii   5  6
     Aa  B
ii    3  4
i    10  2
iii  10  6
     Aa  B
i    10  2
ii    3  4
iii  10  6

In [86]:
# boolean selection
print(my_series3)
print()
print(my_series3[my_series3<3])
print()
print(((titanic.sex == 'female') & (titanic.age >= 30)).head(3)) # selection by multiple columns

yesterday    0
today        1
tomorrow     3
dtype: int64

yesterday    0
today        1
dtype: int64

0    False
1     True
2    False
dtype: bool

In [87]:
# categorical data with order
edu_list = ['BSc Political Science', 'Secondary School'] + ['High School']*2
edu_cats = ['Secondary School', 'High School', 'BSc Political Science']

str_ser = pd.Series(edu_list*10**5)
cats = pd.Categorical(str_ser, categories=edu_cats, ordered=True)
cat_ser2 = pd.Series(cats, index=str_ser.index)
print(cat_ser2[:5])
print()

# 分位数切片分类
cat_ser3 = pd.qcut(pd.Series(np.random.normal(size = 10**6)), q = [0,0.025, 0.975, 1])
cat_ser3.cat.categories

0    BSc Political Science
1         Secondary School
2              High School
3              High School
4    BSc Political Science
dtype: category
Categories (3, object): ['Secondary School' < 'High School' < 'BSc Political Science']

IntervalIndex([(-4.752000000000001, -1.961], (-1.961, 1.964], (1.964, 4.765]], dtype='interval[float64, right]')

In [88]:
# 时间数据 in pandas
str_ser2 = pd.Series(['20170101', '20170727', '20170803', '20171224'])
print(pd.to_datetime(str_ser2)) #datetime格式
print()
print(pd.to_datetime(str_ser2.astype(int))) #epoch time格式
print()

# extract time data
import yfinance as yf
aapl = yf.download("AAPL", data_source='yahoo')['Adj Close']
dt_ser2 = pd.Series(aapl.index)
dt_ser2.dt.year #also year, weekday, hour, second

0   2017-01-01
1   2017-07-27
2   2017-08-03
3   2017-12-24
dtype: datetime64[ns]

0   1970-01-01 00:00:00.020170101
1   1970-01-01 00:00:00.020170727
2   1970-01-01 00:00:00.020170803
3   1970-01-01 00:00:00.020171224
dtype: datetime64[ns]

[*********************100%***********************]  1 of 1 completed

0        1980
1        1980
2        1980
3        1980
4        1980
         ...
10493    2022
10494    2022
10495    2022
10496    2022
10497    2022
Name: Date, Length: 10498, dtype: int64

In [89]:
# name columns and rows
my_df = pd.DataFrame(np.arange(9).reshape(3,3))
cols = []
rows = []
[rows.append(f'row{i + 1}') for i in range(3)] # you can also write ('row{a}'.format(a=i+1))
[cols.append('column'+str(i+1)) for i in range(3)]
             
my_df.columns, my_df.index = cols, rows
my_df

      column1  column2  column3
row1        0        1        2
row2        3        4        5
row3        6        7        8

In [90]:
# method chaining
my_df_new = my_df\
                .rename(columns = {'column1': 'COL100', 'column2': 'COL200', 'column3': 'COL300'})\
                .assign(my_sum = lambda my_df: my_df['COL100']*100+my_df['COL200']*10+my_df['COL300'])\
                .sort_values(by='my_sum', ascending = False)\
                .reset_index(drop=True) # 不显示index列
my_df_new

   COL100  COL200  COL300  my_sum
0       6       7       8     678
1       3       4       5     345
2       0       1       2      12

Deal with missing and duplicated data: see module 3_slides<p>
move missing items: `.dropna(axis=0)`or `(axis=1)`<p>
find duplicated items: `.duplicated()`<p>
move duplicated items: `.drop_duplicates()`

In [91]:
# 去除两列合并起来相同的项
edu_list = ['BSc Political Science', 'Secondary School'] + ['High School']*2
edu_cats = ['Secondary School', 'High School', 'BSc Political Science']
str_ser = pd.Series(edu_list*10**5)
edu_df = pd.DataFrame({'edu': edu_list*10**5, 'num': np.round(np.random.rand(4*10**5),0)})
edu_df.drop_duplicates(['edu', 'num'], keep='first')

                      edu  num
0   BSc Political Science  1.0
1        Secondary School  1.0
2             High School  0.0
5        Secondary School  0.0
8   BSc Political Science  0.0
10            High School  1.0

Merge/Concate types: inner, full/outer, left, right<p>
example: `pd.merge(left, right, on='key', how='outer')`<p>
`pd.concat([df0, df1], join='outer', axis=0, sort=False)`<p>
<center><img src='https://i.stack.imgur.com/1rb1R.jpg' alt="Drawing" style="width: 450px;"/></center>

Split-apply-combine 分组计算再合并: groupby method

In [92]:
tips = sns.load_dataset('tips')
print(tips)
split_var = 'sex' # like x in figure
apply_var = 'total_bill' # like y in figure

tips.groupby(split_var)[apply_var].mean()

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

sex
Male      20.744076
Female    18.056897
Name: total_bill, dtype: float64

In [93]:
# 也可以写成这样
results = {}

for group, group_df in tips.groupby('sex'):  # group:female, group_df:female的所有data
      results[group] = group_df.total_bill.mean() 
    
pd.Series(results)

Male      20.744076
Female    18.056897
dtype: float64

In [94]:
# 多变量操作
split_vars = ['sex', 'time'] 
apply_vars = ['total_bill', 'tip']
apply_fcts = ['median', 'mean', 'std']
combined = tips.groupby(split_vars)[apply_vars].agg(apply_fcts)

print(combined.reset_index() )

      sex    time total_bill                         tip
                      median       mean       std median      mean       std
0    Male   Lunch      16.58  18.048485  7.953435   2.31  2.882121  1.329017
1    Male  Dinner      19.63  21.461452  9.460974   3.00  3.144839  1.529116
2  Female   Lunch      13.42  16.339143  7.500803   2.01  2.582857  1.075108
3  Female  Dinner      17.19  19.213077  8.202085   3.00  3.002115  1.193483

In [95]:
# 将结果添加到原表中的新列, please use 'transform'
tips['mu_sex'] = tips.groupby(split_vars)[apply_var].transform('mean')
tips.tail(5)

     total_bill   tip     sex smoker   day    time  size     mu_sex
239       29.03  5.92    Male     No   Sat  Dinner     3  21.461452
240       27.18  2.00  Female    Yes   Sat  Dinner     2  19.213077
241       22.67  2.00    Male    Yes   Sat  Dinner     2  21.461452
242       17.82  1.75    Male     No   Sat  Dinner     2  21.461452
243       18.78  3.00  Female     No  Thur  Dinner     2  19.213077

`.stack()`: A DataFrame can be collapsed into a Series with the stack command.
反操作: `.unstack()` <p>
melt: which only stacks certain columns<p>
pivot: which allows you to reshape the dataframe like in Excel

In [132]:
df = pd.DataFrame([[1,2],[3,4]],columns=['EU','US'],index=[2000,2010])
print(df)
print()
stacked = df.stack()
print(stacked)
print()
stacked = stacked.reset_index()
print(stacked)
print()
stacked.columns = ['year', 'place', 'some_val']
print(stacked)
print()
pd.melt(stacked, id_vars=['year'], value_vars=['place', 'some_val'])
pd.pivot(stacked,columns='place')

      EU  US
2000   1   2
2010   3   4

2000  EU    1
      US    2
2010  EU    3
      US    4
dtype: int64

   level_0 level_1  0
0     2000      EU  1
1     2000      US  2
2     2010      EU  3
3     2010      US  4

   year place  some_val
0  2000    EU         1
1  2000    US         2
2  2010    EU         3
3  2010    US         4

         year         some_val
place      EU      US       EU   US
0      2000.0     NaN      1.0  NaN
1         NaN  2000.0      NaN  2.0
2      2010.0     NaN      3.0  NaN
3         NaN  2010.0      NaN  4.0